In [139]:
import numpy as np 
import pandas as pd 
import os
import seaborn as sns

In [140]:
# data collection
coffee = pd.read_csv('coffeeTruck.csv')

In [141]:
# view data
coffee

      Unnamed: 0  Location        Music  Price  Sales  Income  Cost  Profit
0              1      Park  Alternative     28     64    1792  1248     544
1              2  Business  Alternative     35     17     595   919    -324
2              3  Business  Alternative     35     22     770   954    -184
3              4      Park       HipHop     32     30     960  1010     -50
4              5      Park       HipHop     35     27     945   989     -44
...          ...       ...          ...    ...    ...     ...   ...     ...
2729        2720      Park       HipHop     32     52    1664  1164     500
2730        2721      Park       HipHop     28     52    1456  1164     292
2731        2722      Park       HipHop     32     46    1472  1122     350
2732        2723      Park       HipHop     28     76    2128  1332     796
2733        2724      Park       HipHop     32     44    1408  1108     300

[2734 rows x 8 columns]

In [142]:
# info
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2734 entries, 0 to 2733
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  2734 non-null   int64
 1   Location    2734 non-null   object
 2   Music       2734 non-null   object
 3   Price       2734 non-null   int64
 4   Sales       2734 non-null   int64
 5   Income      2734 non-null   int64
 6   Cost        2734 non-null   int64
 7   Profit      2734 non-null   int64
dtypes: int64(6), object(2)
memory usage: 171.0+ KB

In [143]:
# list clumns
list(coffee)

['Unnamed: 0',
 'Location',
 'Music',
 'Price',
 'Sales',
 'Income',
 'Cost',
 'Profit']

#### 1. How many rows and coulumns?

In [144]:
# answers to questions (data handling)
coffee.shape

(2734, 8)

#### 2. List all variables

In [145]:
# list clumns
list(coffee)

['Unnamed: 0',
 'Location',
 'Music',
 'Price',
 'Sales',
 'Income',
 'Cost',
 'Profit']

#### 3. find unique values on 'Location' variable

In [146]:
unique_loc = coffee['Location'].unique()

In [147]:
coffee['Location'].value_counts()

Location
Park        2244
CityHall     183
Business     165
Zoo          142
Name: count, dtype: int64

#### 3.1. How many unique locations?

#### 4. Subset the data to include only the observations of sale at the Zoo

In [148]:
coffee_sales = coffee.loc[coffee['Location'] == 'Zoo', :]

In [149]:
coffee_sales

      Unnamed: 0 Location        Music  Price  Sales  Income  Cost  Profit
35            35      Zoo  Alternative     32      2      64   814    -750
36            36      Zoo  Alternative     28     22     616   954    -338
1388        1382      Zoo  Alternative     35      4     140   828    -688
1389        1383      Zoo  Alternative     35     22     770   954    -184
1391        1385      Zoo  Alternative     32     40    1280  1080     200
...          ...      ...          ...    ...    ...     ...   ...     ...
2632        2623      Zoo  Alternative     28     44    1232  1108     124
2636        2627      Zoo  Alternative     32     44    1408  1108     300
2641        2632      Zoo       HipHop     28     40    1120  1080      40
2642        2633      Zoo       HipHop     28     53    1484  1171     313
2643        2634      Zoo       HipHop     28     52    1456  1164     292

[142 rows x 8 columns]

In [150]:
data_duplicates = coffee.duplicated(keep= False)

print(coffee[data_duplicates])

      Unnamed: 0 Location        Music  Price  Sales  Income  Cost  Profit
12            13     Park  Alternative     35     24     840   968    -128
13            13     Park  Alternative     35     24     840   968    -128
42            42     Park  Alternative     28     58    1624  1206     418
43            42     Park  Alternative     28     58    1624  1206     418
155          154     Park  Alternative     35     42    1470  1094     376
156          154     Park  Alternative     35     42    1470  1094     376
448          446     Park  Alternative     35     48    1680  1136     544
449          446     Park  Alternative     35     48    1680  1136     544
874          871     Park  Alternative     35     46    1610  1122     488
875          871     Park  Alternative     35     46    1610  1122     488
1169        1165     Park  Alternative     35     49    1715  1143     572
1170        1165     Park  Alternative     35     49    1715  1143     572
1171        1165     Park  Alternative     35     49    1715  1143     572
1666        1660     Park  Alternative     32     66    2112  1262     850
1667        1660     Park  Alternative     32     66    2112  1262     850
2137        2130     Park  Alternative     35     24     840   968    -128
2138        2130     Park  Alternative     35     24     840   968    -128
2142        2134      Zoo       HipHop     28     48    1344  1136     208
2143        2134      Zoo       HipHop     28     48    1344  1136     208

In [151]:
## count duplicates
data_duplicates.value_counts()

False    2715
True       19
Name: count, dtype: int64

In [152]:
## drop duplicates 
coffee = coffee.drop_duplicates(keep= 'first')

#### 5. How many rows left after drop_duplicates

In [154]:
coffee.shape

(2724, 8)

#### 6. Sort data first by profit (ascending) then music (from Z-A)

In [155]:
sort_profit_and_music = coffee.sort_values(by= ['Profit', 'Music'],
                                           ascending= [True, False])

In [156]:
sort_profit_and_music

      Unnamed: 0  Location        Music  Price  Sales  Income  Cost  Profit
2206        2197       Zoo       HipHop     32      0       0   800    -800
2215        2206  CityHall       HipHop     40      0       0   800    -800
2272        2263  Business       HipHop     40      0       0   800    -800
2298        2289  Business       HipHop     35      0       0   800    -800
2302        2293       Zoo       HipHop     40      0       0   800    -800
...          ...       ...          ...    ...    ...     ...   ...     ...
1890        1883      Park  Alternative     32     78    2496  1346    1150
1925        1918      Park  Alternative     32     78    2496  1346    1150
1454        1448      Park  Alternative     32     79    2528  1353    1175
1647        1641      Park  Alternative     32     79    2528  1353    1175
1799        1792      Park  Alternative     32     81    2592  1367    1225

[2724 rows x 8 columns]

In [157]:
##

#### 7. Create a new variable named 'Indicator' that contain word 'Loss' if Profit of the day < 0 and 'Profit' if > 0 (from sorted data)